In [2]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/uber

In [5]:
%%sql
use de_project;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]

In [3]:
%%sql
show tables;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
2 rows affected.

[('emp_123',), ('high_paid_employees',)]

In [4]:
%%sql
create table CustomerTransactions(
    id INT PRIMARY KEY,
    login_device VARCHAR(50),
    customername VARCHAR(100),
    ip_address VARCHAR(100),
    product VARCHAR(100),
    amount DECIMAL(10,2),
    is_placed BOOLEAN,
    is_viewed BOOLEAN,
    transaction_status VARCHAR(20)
)

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO CustomerTransactions VALUES 
(1, 'Mobile', 'Alice Johnson', '192.168.1.10', 'Bluetooth Speaker', 1999.99, TRUE, TRUE, 'Completed'),
(2, 'Desktop', 'Bob Smith', '172.16.5.22', 'Laptop', 54999.00, TRUE, TRUE, 'Completed'),
(3, 'Tablet', 'Charlie Davis', '10.0.0.5', 'Smartwatch', 8999.50, FALSE, TRUE, 'Viewed'),
(4, 'Mobile', 'Diana Evans', '192.168.0.15', 'Headphones', 2999.99, TRUE, FALSE, 'Pending'),
(5, 'Laptop', 'Ethan Moore', '203.0.113.12', 'Keyboard', 1199.00, FALSE, TRUE, 'Viewed'),
(6, 'Mobile', 'Fiona Clark', '198.51.100.8', 'Monitor', 7999.49, TRUE, TRUE, 'Completed'),
(7, 'Tablet', 'George Lewis', '172.20.14.6', 'Power Bank', 1499.99, TRUE, TRUE, 'Shipped'),
(8, 'Desktop', 'Hannah Lee', '192.0.2.45', 'Gaming Mouse', 2499.00, FALSE, FALSE, 'Cancelled'),
(9, 'Mobile', 'Ian Wright', '10.1.1.1', 'External SSD', 10499.00, TRUE, TRUE, 'Completed'),
(10, 'Laptop', 'Julia Hall', '203.0.113.77', 'Webcam', 3299.89, TRUE, TRUE, 'Completed');

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
10 rows affected.

[]

In [6]:
%%sql
select * from CustomerTransactions;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
10 rows affected.

[(1, 'Mobile', 'Alice Johnson', '192.168.1.10', 'Bluetooth Speaker', Decimal('1999.99'), 1, 1, 'Completed'),
 (2, 'Desktop', 'Bob Smith', '172.16.5.22', 'Laptop', Decimal('54999.00'), 1, 1, 'Completed'),
 (3, 'Tablet', 'Charlie Davis', '10.0.0.5', 'Smartwatch', Decimal('8999.50'), 0, 1, 'Viewed'),
 (4, 'Mobile', 'Diana Evans', '192.168.0.15', 'Headphones', Decimal('2999.99'), 1, 0, 'Pending'),
 (5, 'Laptop', 'Ethan Moore', '203.0.113.12', 'Keyboard', Decimal('1199.00'), 0, 1, 'Viewed'),
 (6, 'Mobile', 'Fiona Clark', '198.51.100.8', 'Monitor', Decimal('7999.49'), 1, 1, 'Completed'),
 (7, 'Tablet', 'George Lewis', '172.20.14.6', 'Power Bank', Decimal('1499.99'), 1, 1, 'Shipped'),
 (8, 'Desktop', 'Hannah Lee', '192.0.2.45', 'Gaming Mouse', Decimal('2499.00'), 0, 0, 'Cancelled'),
 (9, 'Mobile', 'Ian Wright', '10.1.1.1', 'External SSD', Decimal('10499.00'), 1, 1, 'Completed'),
 (10, 'Laptop', 'Julia Hall', '203.0.113.77', 'Webcam', Decimal('3299.89'), 1, 1, 'Completed')]

In [14]:
%%sql
select count(*) from CustomerTransactions where transaction_status not in('Completed', 'Cancelled');

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(4,)]

In [6]:
%%sql
select sum(amount) as Total_Transaction_Amount from CustomerTransactions where transaction_status='Completed';

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(Decimal('78797.37'),)]

In [ ]:
%%sql 
select max(amount) as min_transaction from CustomerTransactions

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(Decimal('54999.00'),)]

In [9]:
%%sql
select min(amount) as min_transaction from CustomerTransactions

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(Decimal('1199.00'),)]

In [10]:
%%sql
select avg(amount) as avg_transaction from CustomerTransactions;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
1 rows affected.

[(Decimal('9599.485000'),)]

In [12]:
%%sql

select login_device,
sum(amount) as total_revenue
from CustomerTransactions group by login_device;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
4 rows affected.

[('Mobile', Decimal('23498.47')),
 ('Desktop', Decimal('57498.00')),
 ('Tablet', Decimal('10499.49')),
 ('Laptop', Decimal('4498.89'))]

In [13]:
%%sql

select login_device,
sum(amount) as total_revenue
from CustomerTransactions group by login_device having sum(amount) > 80000;

 * mysql+mysqlconnector://blackbasil:***@localhost/uber
0 rows affected.

[]